#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results output :session *R:regex*

** サンプル

- 郵便番号を抽出する
#+begin_src R :exports both
strignr::str_extract("〒141-0031 東京都..", "\\d{3}-?\\d{4}")
#+end_src

#+RESULTS:
: [1] "141-0031"
\\

** グループ化 

- (hoge) をひとかたまりとして扱う
#+begin_src R :exports both
stringr::str_detect("hogehoge", "(hoge){2}")
#+end_src

#+RESULTS:
: [1] TRUE
\\

- https://www.yahoo.co.jp/ と https://www.google.co.jp/ の両方にマッチさせたい
#+begin_src R :exports both
urls <- c("https://www.yahoo.co.jp/", "https://www.google.co.jp/")
stringr::str_detect(urls, "https://www\\.(google|yahoo)\\.co\\.jp/")
#+end_src

#+RESULTS:
: 
: [1] TRUE TRUE
\\

** キャプチャ

- グループ化した文字列を参照できるようにすること
- \1, \2, \3 で前方で記憶した文字列にマッチ (後方参照)
- $1, $2, $3 で記憶した文字列を変数として参照
#+begin_src R :exports both
stringr::str_detect("hoge_hoge", "(hoge)_\\1")
#+end_src

#+RESULTS:
: [1] TRUE
\\

** 先読み・後読み

- 後読み (以降にマッチ)
#+begin_src R :exports both
stringr::str_extract("Hello, my name is Michael Jordan.", "(?<=^Hello, ).*")
#+end_src

#+RESULTS:
: [1] "my name is Michael Jordan."

- 先読み (以前にマッチ)
#+begin_src R :exports both
stringr::str_extract("Hello, my name is Michael Jordan.", ".*(?=Michael Jordan)")
#+end_src

#+RESULTS:
: [1] "Hello, my name is "

